jmeter-azure-services/azure-postgresql-database/sqldb-load-test copy.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Database demo" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">postgresql-12.16.jar</stringProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="udv_threads" elementType="Argument">
            <stringProp name="Argument.name">udv_threads</stringProp>
            <stringProp name="Argument.value">${__BeanShell(System.getenv(&quot;threads&quot;))}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="udv_duration" elementType="Argument">
            <stringProp name="Argument.name">udv_duration</stringProp>
            <stringProp name="Argument.value">${__BeanShell(System.getenv(&quot;duration&quot;))}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="udv_database" elementType="Argument">
            <stringProp name="Argument.name">udv_database</stringProp>
            <stringProp name="Argument.value">${__BeanShell(System.getenv(&quot;database&quot;))}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="udv_username" elementType="Argument">
            <stringProp name="Argument.name">udv_username</stringProp>
            <stringProp name="Argument.value">${__BeanShell(System.getenv(&quot;username&quot;))}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="udv_password" elementType="Argument">
            <stringProp name="Argument.name">udv_password</stringProp>
            <stringProp name="Argument.value">${__BeanShell(System.getenv(&quot;password&quot;))}</stringProp>            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration" enabled="true">
        <boolProp name="autocommit">true</boolProp>
        <stringProp name="connectionAge">5000</stringProp>
        <stringProp name="dataSource">test_pool</stringProp>
        <stringProp name="dbUrl">${udv_database}</stringProp>
        <stringProp name="driver">org.postgresql.Driver</stringProp>
        <boolProp name="keepAlive">true</boolProp>
        <stringProp name="password">${udv_password}</stringProp>
        <stringProp name="poolMax">0</stringProp>
        <boolProp name="preinit">false</boolProp>
        <stringProp name="timeout">10000</stringProp>
        <stringProp name="transactionIsolation">DEFAULT</stringProp>
        <stringProp name="trimInterval">60000</stringProp>
        <stringProp name="username">${udv_username}</stringProp>
      </JDBCDataSource>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Azure SQL Database Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${udv_threads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">60</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${udv_duration}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
      <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Select Product" enabled="true">
          <stringProp name="dataSource">test_pool</stringProp>
          <stringProp name="query">SELECT pc.Name as CategoryName, p.name as ProductName
      FROM "SalesLT"."ProductCategory" pc
      JOIN "SalesLT"."Product" p
      ON pc.productcategoryid = p.productcategoryid
      LIMIT 20;</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
        <hashTree/>
        <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="Insert Product" enabled="true">
    <stringProp name="dataSource">test_pool</stringProp>
    <stringProp name="query">DO $$ BEGIN
    IF EXISTS (SELECT 1 FROM "SalesLT"."Product" WHERE "Name" = '${Name}') THEN
        UPDATE "SalesLT"."Product"
        SET "ListPrice" = ${ListPrice}
        WHERE "Name" = '${Name}';
    ELSE
        INSERT INTO "SalesLT"."Product"
            ( "Name"
            , "ProductNumber"
            , "Color"
            , "ProductCategoryID"
            , "StandardCost"
            , "ListPrice"
            , "SellStartDate"
            )
        VALUES
            ('${Name}'
            ,'${ProductNumber}'
            ,'${Color}'
            ,'${ProductCategoryID}'
            ,'${StandardCost}'
            ,'${ListPrice}'
            ,CURRENT_DATE );
    END IF;
END $$;</stringProp>
    <stringProp name="queryType">Update Statement</stringProp>
    <stringProp name="resultSetHandler">Store as String</stringProp>
        </JDBCSampler>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>